#+TITLE: Starter Kit =mu4e= configuration
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

** Better fancy chars
Basically change nothing except uparrow and downarrow (flags are hidden)
#+BEGIN_SRC emacs-lisp
  (defconst mu4e-headers-from-or-to-prefix '("" . ""))
  (setq mu4e-use-fancy-chars t)
  (setq mu4e-headers-has-child-prefix    '("+"  . "+"))
  (setq mu4e-headers-empty-parent-prefix '("-"  . "-"))
  (setq mu4e-headers-first-child-prefix  '("\\" . "\\"))
  (setq mu4e-headers-duplicate-prefix    '("="  . "="))
  (setq mu4e-headers-default-prefix      '("|"  . "|"))
  (setq mu4e-headers-unread-mark         '("u"  . ""))
  (setq mu4e-headers-attach-mark         '("a"  . "+"))
  (setq mu4e-headers-flagged-mark        '("F"  . "!"))
  (setq mu4e-headers-new-mark            '("N"  . "*"))
  (setq mu4e-headers-passed-mark         '("P"  . "»"))
  (setq mu4e-headers-replied-mark        '("R"  . "«"))
  (setq mu4e-headers-seen-mark           '("S"  . ""))
  (setq mu4e-headers-trashed-mark        '("T"  . ""))
  (setq mu4e-headers-signed-mark         '("s" . ""))

  (setq mu4e-headers-thread-child-prefix '("├>" . "↳ "))
  (setq mu4e-headers-thread-last-child-prefix '("└>" . "↳ "))
  (setq mu4e-headers-thread-connection-prefix '("│" . " "))
  (setq mu4e-headers-thread-orphan-prefix '("┬>" . "↳ "))
  (setq mu4e-headers-thread-single-orphan-prefix '("─>" . "↦ "))
  (setq mu4e-headers-threaded-label   '("T" . ""))
  (setq mu4e-headers-full-label       '("F" . "∀"))
  (setq mu4e-headers-related-label    '("R" . ""))
  (setq mu4e-headers-list-mark      '("s" . ""))
  (setq mu4e-headers-personal-mark  '("p" . ""))

  ;; (setq
  ;;  mu4e-headers-draft-mark     '("D" . "💈")
  ;;  mu4e-headers-flagged-mark   '("F" . "📍")
  ;;  mu4e-headers-new-mark       '("N" . "🔥")
  ;;  mu4e-headers-passed-mark    '("P" . "❯")
  ;;  mu4e-headers-replied-mark   '("R" . "❮")
  ;;  mu4e-headers-seen-mark      '("S" . "☑")
  ;;  mu4e-headers-trashed-mark   '("T" . "💀")
  ;;  mu4e-headers-attach-mark    '("a" . "📎")
  ;;  mu4e-headers-encrypted-mark '("x" . "🔒")
  ;;  mu4e-headers-signed-mark    '("s" . "🔑")
  ;;  mu4e-headers-unread-mark    '("u" . "⎕")
  ;;  mu4e-headers-list-mark      '("s" . "🔈")
  ;;  mu4e-headers-personal-mark  '("p" . "👨")
  ;;  mu4e-headers-calendar-mark  '("c" . "📅"))

#+END_SRC

#+RESULTS:
: (p . )

